title: Security tool keyword in download
id: a051ea7b-fe0e-4f29-8852-1d71e739e3fd
description: Searches for security tool associated strings in requests for file downloads
status: stable
author: NTT Security - Axel Olsson
date: '2022-09-02'
modified: '2023-10-31'
logsource:
    category: proxy
detection:
    selection1:
      - c-uri|endswith:
        - '.exe'
        - '.vbs'
        - '.bat'
        - '.rar'
        - '.ps1'
        - '.dll'
        - '.zip'
        - '.sh'
        - '.tar.gz'
        - '.tar'
        - '.7z'
        - '.psm'
        - '.ps'
      - cs-host
        - 'codeload.github.com'
        - 'github.com'
        - 'objects.githubusercontent.com'
    selection2:
      c-uri|contains:
        - 'AdFind'
        - 'BloodHound'
        - 'Empire'
        - 'PSRecon'
        - 'PowerSploit'
        - 'PowerTools'
        - 'PowerSharp'
        - 'PowerShellMafia'
        - 'Powershell-C2'
        - 'powerview'
        - 'PowerRemoteDesktop'
        - 'bypass'
        - 'Mimik'
        - 'Mimid'
        - 'Katz'
        - 'doggy'
        - 'powerkatz'
        - 'secretsdump'
        - 'impacket'
        - 'DonPAPI'
        - 'dpapi'
        - 'Empire'
        - 'Potato'
        - 'BeRoot'
        - 'UACME'
        - 'pupy'
        - 'Koadic'
        - 'Invoke-'
        - 'ldapdomaindump'
        - 'ldapsearch'
        - 'ldap_hashdump'
        - 'windapsearch'
        - 'ad-ldap-enum'
        - 'ldeep'
        - 'ntlmrelayx'
        - 'crackmapexec'
        - 'kerbrute'
        - 'ldd2'
        - 'ConPtyShell'
        - 'winPEAS'
        - 'linPEAS'
        - 'NihilistGuy'
        - 'Pwn'
        - 'Tater'
        - 'kscan'
        - 'lsass'
        - 'plink'
        - 'enum'
        - 'SharpHound'
        - 'Inveigh'
        - 'InternalMonologue'
        - 'Rubeus'
        - 'OffensivePipeline'
        - 'SystemNightmare'
        - 'CVE-'
        - 'shadow'
        - 'Seatbelt'
        - 'LockLess'
        - 'MultiRelay'
        - 'smbmap'
        - 'Bishop'
        - 'stager'
        - 'bacon'
        - 'beacon.exe'
        - 'beacon.dll'
        - 'Hound'
        - 'TSLSASecret'
        - 'psexec'
        - 'PowerShellTcp'
        - 'ClearLogs'
        - 'ADExplorer'
        - 'procdump'
        - 'puppy'
        - 'HTran'
        - 'nmap'
        - 'vuln'
        - 'recon'
        - 'snaffler'
    filter:
      - c-uri|contains:
        - 'pdfsharp'
        - 'GraphSharp'
        - 'restsharp'
        - 'CSIDXLite'
        - 'SharpSnmpLib'
        - 'screendumps'
        - 'tcpdump'
        - 'github.com/go-ldap'
        - '/popwnd/'
        - '/MobaXterm/slash/'
        - 'patchmypc-enum.dll'
        - '/ldap/'
        - 'leappadexplorer'
        - '/Microsoft.SqlServer.'
      - cs-host:
        - 'beacon.scorecardresearch.com'
    condition: all of selection* and not filter
falsepositives:
    - Unknown
level: low
tags:
    - attack.initial_access
