title: Commonly Abused File Hosting Services
id: 15e4317b-76db-4a6e-b0f0-c122ccdba3c5
description: Commonly abused file hosting services utilized to host malicious payloads
status: stable
author: NTT Security - Axel Olsson
references:
    - https://www.securonix.com/blog/threat-labs-security-advisory-new-starkvortex-attack-campaign-threat-actors-use-drone-manual-lures-to-deliver-merlinagent-payloads/ #files.catbox.moe
    - https://www.rnbo.gov.ua/files/2023_YEAR/CYBERCENTER/november/APT29%20attacks%20Embassies%20using%20CVE-2023-38831%20-%20report%20en.pdf #ngrok-free.app apt29 payload hosting
date: 2023/11/22
modified: 2023/12/04
logsource:
    category: proxy
detection:
    selection:
      - url|startswith:
        - 'https://files.catbox.moe/'
      - cs-host|endswith:
        - '.ngrok-free.app'
        - '.ngrok-free.dev'
        - '.ngrok.io'
    filter:
      - url|endswith:
        - '.webp'
      - cs-host:
        - 'c16d-35-240-187-111.ngrok.io' # JS tracking script
    condition: selection and not filter
falsepositives:
    - Legitimate downloads
level: medium
tags:
    - attack.initial_access
