title: Default Covenant HTTP Beacon
id: 07793b33-09c4-48e1-95a7-cd2e7f4ef31c
description: Detects URI combos used by Covenant
status: stable
author: NTT Security - Robin Hellsten
date: '2021-11-05'
modified: '2022-03-17'
references:
    - https://github.com/cobbr/Covenant/blob/c53155615563cf68979820356b8430e4eb01207d/Covenant/Data/Profiles/DefaultHttpProfile.yaml
logsource:
    category: proxy
detection:
    selection:
        c-uri|startswith:
          - '/en-us/index.html'
          - '/en-us/docs.html'
          - '/en-us/test.html'
        c-uri-query|endswith:
          - '&v=1'
        c-useragent:
          - 'Mozilla/5.0 (Windows NT 6.1) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/41.0.2228.0 Safari/537.36'
    condition: selection
falsepositives:
    - Rather common URL patterns as it want to blend in. False positives are possible (but not super common, as UA and query also needs to match)
level: medium
tags:
    - attack.command_and_control
