title: Lumma Stealer C2 Behavior
id: 99a00f52-0a98-4673-95f7-9b4fbf6463a9
description: Searches for common communication patterns with suspiscious tlds associated with Lumma Stealer
status: experimental
author: NTT Security - Leandro Ferreira
date: '2024-09-25'
modified: '2024-09-30'
references:
  - https://medium.com/@Cyfirma_/lumma-stealer-tactics-impact-and-defense-strategies-6f44a682742f
  - https://threatfox.abuse.ch/browse/malware/win.lumma/
  - https://github.com/SamuraiMDR/sigma-rules/blob/main/rules/proxy/lumma_stealer.yml
logsource:
    category: proxy
detection:
    selection:
      cs-method: POST
      c-uri: '/api'
      cs-referer: ""
      cs-host|endswith:
        - .fun
        - .shop
        - .pw
        - .xyz
        - .store
        - .site
    condition: selection
falsepositives:
  - No known cases of false positives
level: high
tags:
  - attack.command_and_control