title: Suspicious Open Redirect
id: f81c69cc-58ba-4ded-8d05-35fb47011b3d
description: Open redirect endpoints that are abused to redirect to phishing sites
status: stable
author: NTT Security - Patrik Olson
date: '2023-08-02'
logsource:
    category: proxy
detection:
    selection_linkedin:
      cs-host: linkedin.com
      c-uri|startswith: '/slink\?code'
    filter:
      cs-referer|contains:
        - linkedin.com
    condition: 1 of selection* and not filter
falsepositives:
    - Investigate where the link redirects to and validate whether it's malicious
level: medium
tags:
    - attack.initial_access
