title: Suspicious html page hosted on Object Storage Services.
id: 9e352642-d557-4e84-ba30-ddac9d613700
description: Suspicious html page hosted on Object Storage Services. Often Maliscious/Phishing
status: experimental
author: NTT Security - Leandro Ferreira, Ramine Etow, Kim Bokholm
date: 2024/02/15
modified: 2024/02/15
logsource:
  category: proxy
detection:
  selection:
    c-uri|endswith:
      - ".html"
      - ".htm"
    cs-host|endswith:
      - ".r2.dev" #Cloudflare object storage
  condition: selection
falsepositives:
  - Legitimate Pages
level: high
tags:
  - attack.initial_access
