title: POST requests from abnormal User-Agent
id: b306ab64-7d04-41cd-94f2-91c2b3c93fe2
description: POST request observed from unexpected user-agents utilized by malware
references:
  - https://www.malware-traffic-analysis.net/2022/06/17/index.html
  - https://threatresearch.ext.hp.com/svcready-a-new-loader-reveals-itself/
  - https://asec.ahnlab.com/en/59387/ # DPRK
status: stable
author: NTT Security - Axel Olsson
date: '2022-08-17'
updated: '2023-11-30'
logsource:
    category: proxy
detection:
    selection1:
      cs-method: 'POST'
    selection2:
      - c-useragent|contains:
        - 'MSOFFICE' # Seen by Matanbuchus: Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 10.0; Win64; x64; Trident/8.0; .NET4.0C; .NET4.0E; .NET CLR 2.0.50727; .NET CLR 3.0.30729; .NET CLR 3.5.30729; Microsoft Outlook 16.0.5197; ms-office; MSOffice 16)
      - c-useragent|startswith:
        - 'svc/'
      - c-useragent:
        - 'Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 10.0; Win64; x64; Trident/7.0; .NET4.0C; .NET4.0E)' # DPRK ahnlab
    filter:
      - url|contains:
        - 'autodiscover'
      - cs-host:
        - 'crashdiag.solidworks.com'
    condition: selection1 and selection2 and not filter
falsepositives:
    - Legitimate POST traffic
level: medium
tags:
    - attack.command_and_control
