title: Qakbot/Pikabot Payload Download
id: 295c3545-5461-4067-9676-1eb137d8c601
status: test
description: Request towards url matching Qakbot/Pikabot payload pattern. Typically leads to download of .zip file containing a .js or .msi payload
references:
  - https://malpedia.caad.fkie.fraunhofer.de/details/win.pikabot
  - https://github.com/pr0xylife/Qakbot/blob/main/Qakbot_bmw01_25.01.2024.txt
author: NTT Security - Robin Hellsten, Patrik Olson, Amata Anantaprayoon
date: '2023-05-23'
modified: '2024-01-26'
logsource:
    category: proxy
detection:
    selection:
      c-uri|re: '^/[a-z]{2,8}/$'
      c-uri-query|re: '^(1|[0-9]{4,8})/{0,}$'
    filter:
      - c-uri: ""
      - c-uri-query: ""
      - action: "B"
    condition: selection and not filter
falsepositives:
    - Legit urls not downloading files
level: medium
tags:
  - attack.initial_access
