title: Rhadamanthys Infostealer User-Agent
id: 0af9c754-a334-44f3-aacc-2aeb42b3c9aa
description: Rhadamanthys infostealer uses a user-agent of curl/5.9 which was released in 1999
status: stable
author: NTT Security - Amata Anantaprayoon, Patrik Olson
date: 2023/01/13
logsource:
    category: proxy
detection:
    selection:
      c-useragent: "curl/5.9"
    condition: selection
falsepositives:
    - Software that hasn't updated their curl library since 1999
level: critical
tags:
    - attack.command_and_control
