title: Phishing Lure in S3 Bucket
id: c67ed899-a5d8-4a13-97ce-7ee3ceb2d487
description: It is common for phishing lures to be served from S3 buckets of various cloud providers
status: stable
author: NTT Security - Patrik Olson
date: 2022/10/17
modified: 2023/05/16
logsource:
    category: proxy
detection:
  post_to_php:
    cs-method: POST
    c-uri|endswith: .php
  objectstorage_referer_misc:
    cs-referer|contains:
      - .linodeobjects.com
      - .digitaloceanspaces.com
      - .dream.io
      - .wasabisys.com
      - .vultrobjects.com
      - .backblazeb2.com
      - storageapi.fleek.co
      - .blob.core.windows.net
      - .r2.dev
  objectstorage_referer_aws:
    cs-referer|endswith: .amazonaws.com
    cs-referer|re: '\bs3\b'
  condition: 'post_to_php and 1 of objectstorage_referer*'
falsepositives:
    - Unlikely
level: high
tags:
    - attack.initial_access
