title: Salty 2FA Phish-as-a-Service credentials exfiltration
id: 3d019406-ad2f-4cb6-bfda-66ddf5e2d274
description: Detects URL pattern matching Salty 2FA data exfiltration
references:
    - https://any.run/cybersecurity-blog/salty2fa-technical-analysis/
status: test
author: NTT Security - Andreas Foureaux
date: 2025-08-22
logsource:
    category: proxy
detection:
    selection:
        http_method|cased: 'POST'
        url_host|endswith: '.ru'
        uri_path|re: '^/[0-9]{5,6}\.php'
    condition: selection
falsepositives:
    - Unlikely, but check if user visited a phishing site just prior.
level: high
