title: Suspiciously Short Download URL of Anomalous Style
id: e9b0c604-707b-44e2-a87c-fbf390eaf8ef
description: Suspiciously short download URL of anomalous style commonly seen during malicious activity.
status: stable
author: NTT Security - Axel Olsson
date: '2022-09-06'
modified: '2023-10-31'
logsource:
  category: proxy
detection:
  selection:
    c-uri|endswith:
      - ".exe"
      - ".vbs"
      - ".bat"
      - ".rar"
      - ".ps1"
      - ".dll"
      - ".zip"
      - ".sh"
      - ".tar.gz"
      - ".tar"
      - ".7z"
      - ".psm"
      - ".ps"
    c-uri|re: '^(/[^/]*){0,2}\/(\w|\d)\.(exe|vbs|bat|zip|rar|ps1|dll|sh|tar\.gz|tar|7z|psm|ps)$'
  filter:
    - cs-host|endswith:
      - ".sharepoint.com"
  condition: selection and not filter
falsepositives:
  - Benign downloads
level: low
tags:
  - attack.initial_access
