title: Xworm Application Layer DDoS Feature
id: c3225cc7-66a1-435a-a093-26be8655b2cd
description: Detects HTTP DDoS feature built in to Xworm. Based on hardcoded characteristics
  of these requests.
status: stable
author: Leandro Ferreira
references:
  - https://vx-underground.org/Builders/XWorm/XWorm%20V6.0
  - https://thehackernews.com/2025/10/xworm-60-returns-with-35-plugins-and.html
date: 2025-12-12
modified: 2025-12-12
logsource:
  category: proxy
detection:
  selection:
    http_method: 'POST'
    http_content_type: 'application/x-www-form-urlencoded'
    uri_path: '/'
  useragents:
    http_user_agent:
      - 'Mozilla/5.0 (Windows NT 6.1; Win64; x64; rv:66.0) Gecko/20100101 Firefox/66.0'
      - 'Mozilla/5.0 (iPhone; CPU iPhone OS 11_4_1 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/11.0 Mobile/15E148 Safari/604.1'
      - 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/60.0.3112.113 Safari/537.36'
  condition: selection and 1 of useragents
falsepositives:
- 'As of this moment Content Length is not parsed and this can therefore trigger some false positives. The hardcoded useragents are old so hopefully not.'
level: medium
