title: Powershell Invoke-RestMethod File Upload
id: f11784ca-5e01-461d-9ec7-2bb0d1f4988f
description: Usage of Invoke-RestMethod to upload a file. This behavior was observed
  in the Russian APT attack on Polish OT-Infrastructure.
references:
- https://cert.pl/uploads/docs/CERT_Polska_Energy_Sector_Incident_Report_2025.pdf
- https://learn.microsoft.com/en-us/powershell/module/microsoft.powershell.utility/invoke-restmethod
status: stable
author: Axel Olsson
date: 2026-02-12
modified: 2026-02-12
logsource:
  product: windows
  category: ps_script
detection:
  selection:
    script_block|contains|all:
    - Invoke-RestMethod
    - -Uri
    - -Method Post
    - -InFile 
  condition: selection
falsepositives:
- Legitimate use of Invoke-RestMethod
level: medium
