title: Powershell New-NetFirewallRule Suspicious Locally Allowed Port
id: 337134fa-b455-470c-a345-a29d93399da3
description: Usage of New-NetFirewallRule to create local firewall opening for suspicious port. This behavior was observed
  in the Russian APT attack on Polish OT-Infrastructure.
references:
- https://cert.pl/uploads/docs/CERT_Polska_Energy_Sector_Incident_Report_2025.pdf
- https://learn.microsoft.com/en-us/powershell/module/netsecurity/new-netfirewallrule
status: stable
author: Axel Olsson
date: 2026-02-12
modified: 2026-02-12
logsource:
  product: windows
  category: ps_script
detection:
  selection_1:
    script_block|contains|all:
    - New-NetFirewallRule
    - -Name
    - -DisplayName
    - -LocalPort
    - Allow
  selection_2:
    script_block|contains:
    - '445'
    - '3389'
  condition: selection_1 and selection_2
falsepositives:
- Legitimate Firewall Rule
level: medium
