title: CloudflareD Tunnel Established
id: d7da7a43-4738-49d0-9702-4c74274dc380
description: CloudflareD establishes a reverse tunnel to CloudFlare that exposes one or multiple local network
  services to the internet, bypassing ingress firewall rules. Has been abused by threat actors as a C2 channel.
status: test
author: NTT Security - Patrik Olson
date: 2024/03/04
modified: 2024/03/05
references:
  - https://www.guidepointsecurity.com/blog/tunnel-vision-cloudflared-abused-in-the-wild/
  - https://blog.bushidotoken.net/2023/09/tracking-adversaries-akira-another.html # Akira has used cloudflared to tunnel C2 traffic
  - https://www.cloudflare.com/ips-v4 # CloudFlare's IPv4 ranges
  - https://www.cloudflare.com/ips-v6 # CloudFlare's IPv6 ranges
tags:
  - attack.defense_evasion
  - attack.t1599
logsource:
  category: firewall
detection:
  selection:
    dest_port: 7844
    dest_ip|cidr:
      - 173.245.48.0/20
      - 103.21.244.0/22
      - 103.22.200.0/22
      - 103.31.4.0/22
      - 141.101.64.0/18
      - 108.162.192.0/18
      - 190.93.240.0/20
      - 188.114.96.0/20
      - 197.234.240.0/22
      - 198.41.128.0/17
      - 162.158.0.0/15
      - 104.16.0.0/13
      - 104.24.0.0/14
      - 172.64.0.0/13
      - 131.0.72.0/22
      - 2400:cb00::/32
      - 2606:4700::/32
      - 2803:f800::/32
      - 2405:b500::/32
      - 2405:8100::/32
      - 2a06:98c0::/29
      - 2c0f:f248::/32
  condition: selection
falsepositives:
- Legitimate use of cloudflared tunnels
level: high
