title: Suspicious Registry Import
id: bb406664-ae52-4ea2-bde5-0a0cf0438aca
description: >-
  Some malware droppers consist of a single .reg file that writes a base64
  encoded payload into registry and creates a Run key for execution/persistence.
  Investigate where the .reg file comes from and if possible, if it creates any
  suspicious registry keys.
status: stable
author: NTT Security - Patrik Olson
date: 2024-08-19
logsource:
  product: windows
  category: process_creation
detection:
  selection_reg_import:
    Image|endswith: '\regedit.exe'
    CommandLine|contains: '.reg'
  selection_suspicious_path:
    CommandLine|contains:
      - '\Downloads\'
      - '\Local\Temp\'
  condition: all of selection*
falsepositives:
  - Unknown
level: medium
tags:
  - attack.initial-access
  - attack.execution
  - attack.persistence
  - attack.t1547.001
